<template>
    <div class="page-container">
         <el-breadcrumb>
            <el-breadcrumb-item :to="{ path: '/' }" >首頁</el-breadcrumb-item>
            <el-breadcrumb-item>服務項目</el-breadcrumb-item>
            <el-breadcrumb-item>美麗重現</el-breadcrumb-item>
            <el-breadcrumb-item>眼袋手術</el-breadcrumb-item>
        </el-breadcrumb>
        <Title title="眼袋手術" titleEn="EYEBAG" />
       
        <div class="article-container service-page">
            <img src="~/assets/img/service/surgerySculpture/eyebag/banner.jpg" alt="眼袋手術 Banner">

            <h2>擁有明眸青春的雙眼</h2>
            <p>初次見面，多數人最先注意對方的臉部，最深刻的部分就是眼睛。眼睛是靈魂之窗也是五官之中最受人注目的焦點，就算輪廓再立體，五官在精緻，即便擁有一雙迷人的大眼，但眼袋的出現，不但使兩眼無神也不小心洩漏了年紀的痕跡，使美麗大打折扣，失去了原有的神采。</p>
        
         
            <h2>眼袋種類</h2>
            <p>眼袋根據不同的臨床表現可細分為六大類：</p>
            <h3>+ 脂肪突出型眼袋</h3>
            <p>因眼眶內脂肪堆積過多或下眼部結締組織變薄弱，即形成眼眶內脂肪突出於眼眶外，或先天眼眶內脂肪較多而膨出，形成眼袋。</p>
            <h3>+ 鬆弛形眼袋</h3>
            <p>單純皮膚鬆弛。因下瞼及外眥皮膚鬆弛，但無眶膈鬆弛，所以無眶隔脂肪突出，眼周伴有細小皺紋出現。</p>
            <h3>+ 混合型眼袋</h3>
            <p>有眶隔脂肪膨出型眼袋的問題，同時伴有下瞼的皮膚鬆弛。</p>
            <h3>+ 淚溝型眼袋</h3>
            <p>由於脂肪層的下垂及肌肉層鬆弛而逐漸形成的眼袋。</p>
            <h3>+ 骨骼結構型眼袋</h3>
            <p>可能是由於先天骨骼發育不全，以致淚溝型眼袋伴隨中臉頰下垂。</p>
            <h3>+ 水腫型眼袋</h3>
            <p>一種短暫型眼袋。常發生在睡前喝太多水、飲食重口味、鼻過敏、生理期、懷孕等循環狀況較差的人身上，俗稱泡泡眼，是屬於假性眼袋。可藉由促進循環的方式改善。</p>
         
            <h2>手術方式</h2>
            <h3>內開式眼袋手術</h3><p>適合眼窩脂肪突出的年輕族群。手術方式經由內眼瞼處結膜下1~2個切口將眼窩脂肪取出，隱藏式傷口。主要的優點在於能保留臥蠶而且外觀不會有疤痕產生，術後恢復時間較短。</p>
            <img   src="~/assets/img/service/surgerySculpture/eyebag/1.jpg" alt="開式眼袋手術">
        
         
            <h3>外切式眼袋手術</h3>
            <p>手術方式是沿著下眼睫毛做切口，將多餘脂肪適量取出或是做脂肪回填淚溝，特色是可將鬆弛的皮膚移除，適合年紀較長者，可以達到去除眼袋脂肪及下眼袋皺紋之雙重效果。</p>
            <img   src="~/assets/img/service/surgerySculpture/eyebag/2.jpg" alt="外切式眼袋手術">
            <h4>本療程的效果可能因個人體質的不同而有差異，請務必與醫師溝通諮詢</h4>
         
            <h2>美麗案例</h2>
            <img   src="~/assets/img/service/surgerySculpture/eyebag/案例1.png" alt="案例1
            ">
            <img   src="~/assets/img/service/surgerySculpture/eyebag/案例2.png" alt="案例2
            ">
            <h4>療程效果會因個人體質而有所差異</h4>
         
            <h2>術後小叮嚀</h2>
            <ul>
                <li>+ 術後72小時內，少請持續冰敷，一天至少四小時，一次15~20分鐘。</li>
                <li>+ 手術後三天，視瘀青情況溫敷，一天至少四小時，一次15~20分鐘。</li>
                <li>+ 傷口護理:先以無菌棉棒沾生理食鹽水清理傷口，再利用乾的棉棒擦拭最後塗抹藥膏於傷口上，早晚各一次，不可碰生水，以免感染。</li>
                <li>+ 傷口恢復期間，避免吃刺激性食物(如:菸、酒、其他提神之飲料、辣椒、咖啡)，活血類食品如銀杏、人蔘、當歸、麻油、維他命E等，多吃高蛋白食物(如:蛋、豆、魚、肉、奶類、維他命C)，促進傷口癒合。</li>的
                <li>+ 傷口不可碰到水，早晚以棉棒沾取生理食鹽水清潔，塗抹藥膏，但無需覆蓋紗布。</li>
                <li>+ 術後5~7天拆線，拆線後滿24小時才可碰水洗臉，以免傷口感染。</li>
                <li>+ 切勿以手搓揉眼部。</li>
                <li>+ 術後眼下會貼固定的膠帶，需經過醫療人員同意才可撕掉。</li>
                <li>+ 術後2週內請勿載隱形眼鏡。</li>
                <li>+ 術後有腫脹情況，屬正常情形，盡量抬高頭部促進血液循環，避免彎腰低頭提重物。</li>
                <li>+ 眼袋手術後可能產生結膜水腫，絕大多數患者均會自行消退，所需時間不一，期間亦可配點用眼藥水以紓解症狀。</li>
                <li>+ 約於眼袋手術後一~二個月就可逐漸自然。若術後有異常腫脹疼痛，請立即與本診所聯絡。</li>
                <li>+ 術後請按衛教單執行，並按時間返診。</li>
            </ul>
        </div>
    </div>
</template>