// state
export const state = () => ({
    pageId: null,
    teamGroup: [
        {
            name: '洪欣瑜',
            title: '臉部雕塑專家',
            id: '0',
            path: '/maxBeauty/team/0',
            experience: [
                '美仕媞時尚醫美診所院長',
                '台灣整形外科醫學醫學會會員',
                '中華民國醫用雷射光電醫學會會員',
                '新光醫院 整形外科主治醫師',
                '台安醫院 整形外科主治醫師',
                '台北秀傳醫院-醫學美容整外專科醫師',
                '台灣美容醫學職能教育發展協會理事',
                '國際SOS國際緊急醫療轉送醫師',
                '長庚醫院顱顏中心正顎削骨手術臨床研究',
                '2008北京第一屆全球華裔整形外科醫師大會',
                '2009美國美容外科醫學會(ASAPS0)年會於拉斯維加斯研究會',
                '美國洛杉磯Laguna Beach隆乳大師',
                'Dr.Daniel C.Mill Clinic臨床研究',
                '日本東京大學整形外科脂肪幹細胞臨床研究',
                '日本東京整形外科診所日式拉皮臨床研究',
                '韓國首爾Mary’s Hospital of Catholic Medical School 臨床研究',
                '韓國心美掩鼻部整形專科醫院鄭東學教授指導'
            ],
            skill: [
                '面部雕塑手術(微整形注射、面部線條調整、面部線條提升)',
                '眼周手術(雙眼皮、眼神雕塑、開眼頭、眼袋手術)',
                '抽脂與自體脂填充回春',
                '隆鼻手術、隆乳手術'
            ],
            certificate: []
        },
        {
            name: '王彥儒',
            title: '體雕抽脂達人',
            id: '1',
            path: '/maxBeauty/team/1',
            experience: [
                '美仕媞時尚醫美診所醫師',
                '台北醫學大學附設醫院主治醫師',
                '桃園長榮醫院主治醫師',
                '中華民國美容醫學會會員',
                '台灣亞太美容外科醫學會會員',
                '美國美容醫學醫學會會員',
                '美國美容外科學會會員',
                '義大利雷射溶脂DEKA原廠認證醫師',
                '3D聚左旋乳酸(Sculptra)原廠認證醫師'
            ],
            skill: [
                '輪廓整形: 豐額 / 太陽穴 / 淚溝 / 蘋果肌 / 法令紋 / 豐額',
                '身體雕塑: 大腿內外側 / 屁股微笑線 / 蝴蝶袖 / 前後副乳 / 背部腰線',
                '胸部整形: 抽脂補胸 / 胸型改善',
                '皮膚美容: 音波拉皮 / 雷射光療 / 微整注射'
            ],
            certificate: []
        },
        {
            name: '洪曼珊',
            title: '光電療雷射專家',
            id: '2',
            path: '/maxBeauty/team/2',
            experience: [
                '中華兩岸全效抗衰老促進協會常務監事',
                '英國加地夫臨床皮膚科研究所',
                '美國哈佛大學雷射光電認証',
                '安徽醫科大學皮膚學碩士',
                '台南市立醫院總醫師',
                '成功大學醫學系醫學士',
                '第九屆海峽兩岸微整形美容醫學會(演講)',
                '第十屆海峽兩岸微整形美容醫學會(演講)',
                '兩岸全效抗衰老臨床技術研討會(注射示範)',
                'Allergan肉毒桿菌注射原廠認證',
                '少女針Ellanse原廠認證',
                '童顏針sculptra原廠認證',
                '瑞藍玻尿酸原廠認證',
                'Merz微晶瓷原廠認證',
                '幹細胞治療研習認證'
            ],
            skill: [
                '雷射光電治療',
                '皮膚年輕化治療',
                '微整型全臉雕塑'
            ],
            certificate: []
        },
        {
            name: '游景雯',
            title: '臉部雕塑專家',
            id: '3',
            path: '/maxBeauty/team/3',
            experience: [
                '美仕媞時尚醫美診所醫師',
                '台灣大學醫學系畢業',
                '日本慶応大學附設醫院外科見習醫師',
                '日本慈惠會醫科大學外科見習醫師',
                '倫敦藝術大學 藝術學程結業',
                '微整形美容醫學專科醫師'
            ],
            skill: [
                '女性私密處緊緻 / 美白 / 除毛療效',
                '童顏針液態拉皮 / 音波電波拉皮',
                '玻尿酸豐額 / 頰 / 夫妻宮 / 蘋果肌 / 法令紋',
                '光療淨膚 / 飛梭 / 彩衝光 / 光繞雷射'
            ],
            certificate: [
                '皮秒雷射原廠認證',
                '晶亮瓷原廠認證',
                '微整形美容醫學會會員',
                'Juvederm、Restylane玻尿酸注射研習醫師',
                'Botox注射研習醫師',
                'Dysport注射研習醫師',
                'Ulthera美國音波療程研習醫師'
            ]
        },
        {
            name: '倪宗聖',
            title: '五官妙手權威',
            id: '4',
            path: '/maxBeauty/team/4',
            experience: [
                '美仕媞時尚醫美診所整型外科醫師',
                '外科專科醫師 (外專醫字第005447號)',
                '中華民國整形外科專科醫師 (整專醫字第000469號)',
                '台北馬偕紀念醫院整形美容外科主治醫師',
                '馬偕醫學院臨床講師',
                '韓國首爾 BANOBAGI整形醫院臨床研究員',
                '韓國首爾 MD整形醫院臨床研究員',
                '韓國首爾 Shimmian鼻整形醫院臨床研究員',
                '美國喬雅登玻尿酸注射認證醫師',
                '美國愛力根肉毒桿菌注射認證醫師',
                '瑞典Restylane玻尿酸注射認證醫師'
            ],
            skill: [
                '顏面骨折 / 手外科及顯微手術 / 新式無痕眼袋手術',
                '釘書機雙眼皮手術 / 韓式鼻整形手術 / 下巴精雕手術',
                '全臉精雕補脂手術 / 乳房整型手術 / 自體脂肪豐胸手術',
                '全身抽脂手術 / 內視鏡提眉 / 五爪拉皮',
                '4D埋線拉提手術 / 電波拉皮'
            ],
            certificate: []
        },
        {
            name: '張東美',
            title: '速塑纖體達人',
            id: '5',
            path: '/maxBeauty/team/5',
            experience: [
                '美仕媞時尚醫美診所醫師',
                '長庚兒童醫院主治醫師',
                '台北長庚醫院新生兒專科醫師',
                '台北長庚醫院兒童加護病房主任',
                '台北長庚醫院高危險妊娠胎兒照護醫師',
                '美國德州兒童營養研究中心研究員',
                '中華民國醫用雷射光電學會會員',
                'Allergen玻尿酸原廠認證醫師',
                'Restylane玻尿酸原廠認證醫師',
                'Sculptra原廠認證醫師',
                'Radiesse原廠認證醫師',
                'Botox原廠認證醫師',
                'Ultherapy音波拉提認證醫師',
                'Fotona G緊雷射認證醫師'
            ],
            skill: [
                '女性私密緊緻療程',
                '音波拉皮 / 電波拉皮 / 玻尿酸豐額(頰)',
                '夫妻宮 / 蘋果肌 / 法令紋 / 光療淨膚',
                '飛梭雷射治療 / 飛針 / 水光注射治療'
            ],
            certificate: []
        },
        {
            name: '雲曉權',
            title: '童顏再造達人',
            id: '6',
            path: '/maxBeauty/team/6',
            experience: [
                '美仕媞時尚醫美診所醫師',
                '高雄醫學大學醫學系畢業',
                '中港澄清醫院外科醫師',
                '台灣外科醫學會醫師',
                '台灣微整形美容醫學會醫師',
                '台灣微整形專科醫師證書',
                '3D聚左旋乳酸(Sculptra) 高階注射技術認證醫師'
            ],
            skill: [
                '埋線拉皮 /立體4D埋線 / 羽毛線 / 微整形美感雕塑',
                '極線音波拉皮 / 電波拉皮 /舒顏萃液態注射拉皮',
                '自體生長因子注射-退化關節修護 / 肉毒除皺',
                '瘦小臉+拉提注射 / 玻尿酸全臉八點拉提',
                '健康體重管理 / 抗衰老預防醫學諮詢'
            ],
            certificate: []
        },
        {
            name: '林大欽',
            title: '美容權威',
            id: '7',
            path: '/maxBeauty/team/7',
            experience: [
                '美仕媞時尚醫美診所醫師',
                '臺北榮民總醫院外科專科醫師',
                '臺灣外科醫學會專科醫師',
                '臺灣美容醫學專科醫師',
                '中華民國美容醫學會微整形訓練高分通過(肉毒桿菌、玻尿酸)',
                '中華民國醫用雷射光電醫學會會員',
                '亞洲抗老化美容醫學會會員',
                '亞洲抗老化美容醫學會雙眼皮訓練高分通過',
                '3D聚左旋乳酸(Sculptra)原廠認證醫師',
                'Ulthera極線音波拉皮認證',
                '中華民國肥胖醫學會會員'
            ],
            skill: [
                '綜合換膚 / 極線音波拉皮 / 電波拉皮',
                '舒顏萃液態注射拉皮 / 玻尿酸全臉八點拉提',
                '肉毒除皺 / 飛針 / 水光注射治療',
                '飛梭雷射 / 除斑雷射 / 除毛雷射',
                '肥胖減重醫學 / 抗老化美容醫學'
            ],
            certificate: []
        },
        {
            name: '李毓軒',
            title: '美容專科醫生',
            id: '8',
            path: '/maxBeauty/team/8',
            experience: [
                '美仕媞時尚醫美診所醫師',
                '高雄醫學大學醫學系畢業',
                '台灣外科學會會員',
                'Radiesse 晶亮瓷原廠認證',
                'Hyadermis玻尿酸原廠認證',
                'Ulthera/ultraskin 美國音波拉提原廠認證及進階學程認證',
                '膠原蛋白皮下注射研習',
                '韓國首爾進階 Thread Lifting埋線拉提認證',
                '韓國首爾肉毒進階研習',
                '韓國Hirhino 4D線鼻雕手術研習認證'
            ],
            skill: [
                '女性私密緊緻療程',
                '音波拉提 全臉埋線拉提  / 舒顏萃液態注射拉皮',
                '肉毒桿菌全臉除皺/ 露齒笑注射',
                '瘦小臉 / 瘦小腿注射',
                '玻尿酸皮下注射/微晶瓷鼻下巴整形',
                '除斑雷射/凹疤飛梭/PRP生長因子飛針全臉回春'
            ],
            certificate: []
        },
    ]
});

// actions
export const actions = {
    setPageId({ commit }, pageId) {
        commit("setPageId", pageId);
    }
};

// mutations
export const mutations = {
    setPageId(state, pageId) {
        state.pageId = pageId
    }

};

// getters
export const getters = {
    getTeamData: state => {
        return state.teamGroup;
    },
    getPageId: state => {
        return state.pageId;
    }
};
